[Admins]
; Администраторы плагина
; Пример (добавлять нужно без символа комментария ";" в начале строки):
; Admin=1

[Mafia]
; Канал игры
Channel=мафия
; Канал помощи
ChannelHelp=мафия (описание и правила)
; Основные каналы чата (используются для сообщения о начале игры)
; Вы можете задать до 8 каналов. Используйте параметры ChannelMain1, ChannelMain2, ..., ChannelMain8
ChannelMain1=main
; Eсли параметр установлен в 1, большинство настроек будет обновляться из ini файла при каждой новой игре (!старт)
; Описание получаемых очков (Help_*) и игровые фразы из messages.ini ВСЕГДА читаются из ini файла, независимо от значения этого параметра
ReloadSettingsOnStart=1
; Eсли параметр установлен в 1, участвовать в игре можно только один раз с одного IP
IPFilter=0
; Eсли параметр установлен в 1, участвовать в игре можно только один раз с одного ID компьютера (игнорируется, если плагин запущен на клиенте).
IDFilter=0
; Имя бота (игнорируется, если плагин запущен на клиенте).
BotName=Mafiozi
; Пароль бота (игнорируется, если плагин запущен на клиенте).
BotPass=mafiarulez
; Пол бота (1 - женский, иначе - мужской) (игнорируется, если плагин запущен на клиенте).
BotIsFemale=1
; IP бота (игнорируется, если плагин запущен на клиенте).
BotIP=N/A
; Состояние бота (игнорируется, если плагин запущен на клиенте).
BotState=Бот игры Мафия
; Состояние бота при наборе игроков (игнорируется, если плагин запущен на клиенте).
; Раскомментируйте следующую строчку, если хотите использовать
; BotStatePlayerGetting=Набираю игроков
; Состояние бота при игре (игнорируется, если плагин запущен на клиенте).
; Раскомментируйте следующую строчку, если хотите использовать
; BotStatePlay=Играю

; Тема канала при отсутствии игры.
; Раскомментируйте следующую строчку, если хотите использовать
; TopicWait=Канал психологической игры "Мафия"
; Тема канала при наборе игроков.
; Раскомментируйте следующую строчку, если хотите использовать
; TopicPlayerGetting=Идет набор игроков
; Тема канала при игре.
; Раскомментируйте следующую строчку, если хотите использовать
; TopicPlay=Идет игра

; Цена маскировочного комплекта
MaskPrice=20
; Цена рации
RadioPrice=15
; Действие рации (ночей)
RadioNights=1
; "Быстрая игра": если параметр установлен в 1, производится автоматический переход на следующую контрольную точку, когда сходили все игроки.
FastGame=1
; Количество показываемых игроков  в "!топ" по умолчанию (0-20).
TopDefault=15
; Время на набор игроков (0-360 сек)
TimeStart=60
; Время на подтверждение роли (если 0, подтверждение не используется) (0-360 сек)
; Если значение параметра ShowRolesOnStart в игровом режиме (gametypes.ini) равно 1, то при подтверждении роли в игровой канал отправляется соответствующее уведомление.
TimeAccept=30
; Продолжительность ночи (0-360 сек)
TimeNight=60
; Продолжительность утра (время на обсуждение) (0-360 сек)
TimeMorning=25
; Продолжительность дня (время на голосование) (0-360 сек)
TimeDay=60
; Время на последнее слово (0-360 сек)
TimeLastWord=10
; Продолжительность вечера (время на подтверждение голосования) (0-360 сек)
TimeEvening=20
; Время паузы между сообщениями бота (мс). Между некоторыми сообщениями используется удвоенное значение паузы.
TimePause=1000
; Время бана (дни). Допускаются значения в виде десятичных дробей.
TimeBan=1
; Eсли параметр установлен в 1, начинать с ночи, иначе - с утра
StartFromNight=1
; Eсли параметр установлен в 1, ночью будут показаны действия игроков
ShowNightActions=0
; Режим игры по умолчанию (должен совпадать с именем секции в mafia_gametypes.ini)
DefaultGametype=Gametype_0

; Если параметр установлен в 1, бот будет автоматически банить трупов (игнорируется, если плагин запущен на клиенте).
BanOnDeath=1
; Если параметр установлен в 1, бот будет автоматически накладывать запрет на приватную переписку трупам (игнорируется, если плагин запущен на клиенте; игнорируется, если предыдущий параметр не установлен).
BanPrivateOnDeath=0
; Причина бана трупов
BanReason=Выбывание из игры
; Причина бана трупов на личные сообщения
BanPrivateReason=Выбывание из игры
; Причина разбана трупов.
UnbanReason=Окончание игры
; Если параметр установлен в 1, статистика будет выводиться в приват
StatToPrivate=0

; Все сообщения бота в публичные каналы будут иметь вид "ЗНАЧЕНИЕ_MsgFormatBegin+сообщение+ЗНАЧЕНИЕ_MsgFormatEnd"
; Не рекомендуется использовать [url] и [b] в значениях этих параметров.
MsgFormatBegin=
MsgFormatEnd=

; Тип отправляемых сообщений
; 0 - по умолчанию
; 1 - отправлять всегда сообщениями
; 2 - отправлять всегда состояниями (F9)
MessagesType=0

; Тип действия при смене игрового режима
; 0 - нет действия
; 1 - изменить тему
; 2 - сообщение в канал
; 3 - изменить тему и написать сообщение в канал
ChangeGametypeNotify=1

; Автоматическое изменение режима игры после указанного количества игр. 0 - отключено.
ChangeGametypeGamesCount=0

; Если параметр установлен в 1, то после каждого голосования за посадку будут отображаться получаемые командами очки.
ShowVotePoints=0

; Если игрок не будет голосовать на дневном голосовании в течение этого количества дней, то он будет автоматически убит. (1-254, все остальные значение соответствуют 255 дням).
KillForNoActivity=0

; Игроки, не играющие указанное количество дней, будут автоматически удалены из базы.
; ВНИМАНИЕ: ненулевое значение параметра может привести к нежелательной чистке базы игроков!
TimeRemoveUsers=0

[Stats]
; См. ReadMe (Помощь по шаблонам статистики) для дополнительной информации
; Если параметр установлен в 1, бот будет обновлять приветствие
UpdateGreeting=0
; Если параметр установлен в 1, статистика будет экспортироваться во внешний файл в конце каждой игры
Export=0
; Имя файла, в который будет экспортироваться статистика
File=C:\MafStats.html

[MafiaRoles]
; В этой секции можно переопределить названия ролей
; Формат параметра: Role_НОМЕРРОЛИ_ПАДЕЖ
; Номера ролей можно посмотреть в ReadMe.
; Используется 0, 1, 2, 3 падежи, пример - ниже. Думаю, все вполне понятно:)
; Кто? Что?
Role_1_0=Мирный гражданин
; Кем? Чем?
Role_1_1=мирным гражданином
; Кого? Что?
Role_1_2=мирного гражданина
; Кого? Чего?
Role_1_3=мирного гражданина

[MafiaPoints]
; В этой секции настраивается количество очков, получаемое за те или иные игровые действия.
; Параметр НОМЕР отвечает за само количество очков.
; Параметр Help_НОМЕР отвечает за описание в !хелп.

; За победу
1=10
Help_1=За победу всем выжившим в победившей команде
; За ничью
2=3
Help_2=За ничью всем выжившим


; Ночь
; Доктору за спасение честного (любого, в том числе и комиссара)
3=3
Help_3=Доктору за спасение честного
; Доктору за спасение комиссара (складывается со значением предыдущего параметра)
4=1
Help_4=Доктору за спасение комиссара (прибавляется к очкам за спасение честного)
; Доктору за спасение мафа
5=-2
Help_5=Доктору за спасение мафа
; Нейтралу за каждое убийство
6=5
Help_6=Нейтральному персонажу за каждое убийство
; Комиссару/бомжу за убийство/вычисление мафа
7=3
Help_7=Комиссару/бомжу за убийство/вычисление мафа
; Шерифу за убийство мафа
8=3
Help_8=Шерифу за убийство мафа
; Шерифу/комиссару за убийство честного
9=-2
Help_9=Шерифу/комиссару за убийство честного
; Шерифу за убийство комиссара (складывается со значением предыдущего параметра)
10=-1
Help_10=Шерифу за убийство комиссара (прибавляется к очкам за убийство честного)
; Мафам, киллеру и якудзе за убийство комиссара (складывается с очками за любое убийство)
11=3
Help_11=Мафам, киллеру и якудзе за убийство комиссара
; Мафам за убийство якудзы и наоборот (складывается с очками за любое убийство)
12=3
Help_12=Мафам за убийство якудзы и якудзе за убийство мафа
; Адвокату за вычисление комиссара
13=5
Help_13=Адвокату за вычисление комиссара
; Путане за блокировку комиссара
14=-2
Help_14=Путане за блокировку комиссара
; Путане за блокировку мафа
15=3
Help_15=Путане за блокировку мафа
; Мафам и якудзе за любое убийство
16=0
Help_16=Мафам и якудзе за любое убийство
; Грабителю за каждое избиение (минимальное количество очков)
17=4
Help_17=Грабителю за каждое избиение (минимальное количество очков)
; Грабителю за каждое избиение (максимальное количество очков)
18=7
Help_18=Грабителю за каждое избиение (максимальное количество очков)

; За дневное голосование
; Судье за оправдание честного
151=3
Help_151=Судье за оправдание честного
; Судье за оправдание комиссара (складывается со значением предыдущего параметра)
152=1
Help_152=Судье за оправдание комиссара (прибавляется к очкам за спасение честного)
; Судье за оправдание мафа или якудзы
153=-3
Help_153=Судье за оправдание мафа или якудзы
; Честным за повешение честного (только тем, кто против него голосовал)
154=-1
Help_154=Честным за повешение честного (только тем, кто против него голосовал)
; Честным за повешение комиссара (только тем, кто против него голосовал) (складывается со значением предыдущего параметра)
155=-3
Help_155=Честным за повешение комиссара (только тем, кто против него голосовал) (прибавляется к очкам за повешение честного)
; Мафам за повешение комиссара (только тем, кто против него голосовал)
156=3
Help_156=Мафам за повешение комиссара (только тем, кто против него голосовал)
; Честным и мафам за повешение якудзы, честным и якудзе за повешение мафа (только тем, кто против него голосовал)
157=3
Help_157=Честным и мафам за повешение якудзы, честным и якудзе за повешение мафа (только тем, кто против него голосовал)
; Мафам и якудзе за повешение мирного (только тем, кто против него голосовал)
158=1
Help_158=Мафам и якудзе за повешение мирного (только тем, кто против него голосовал)

[Advanced]
; Режим линковки, при котором плагину-линковщику будут отправляться специальные сообщения для работы с каналами мафов и якудз.
; Не включайте без необходимости ;)
LinkMode=0
; Имя виртуального пользователя плагина-линковщика (игнорируется, если режим линковки (LinkMode) не включен).
LinkerName=Linker
; Номер канала, который будет использоваться в линковщике для логова мафов (1-16) (игнорируется, если режим линковки (LinkMode) не включен).
LinkerChannelMaf=15
; Номер канала, который будет использоваться в линковщике для логова якудз (1-16) (игнорируется, если режим линковки (LinkMode) не включен).
LinkerChannelYakuza=16